# Table of Contents

* [Data Sources](#Data-Sources)
* [Gather the Data](#Gather-the-Data)
    * [Merge Dataframes / Tables](#Merge-Dataframes-/-Tables)
* [Explore the Data](#Explore-the-Data)
* [Model the Data](#Model-the-Data)
* [Visualize the Results](#Visualize-the-Results)


<hr>

## Data Sources

Description of the IMDB data: https://www.imdb.com/interfaces/

IMDB Data Sources: https://datasets.imdbws.com/

<hr>

## Gather the Data

In [1]:
%matplotlib inline

In [2]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import statsmodels.api as sm

In [3]:
sns.set(rc={'figure.figsize': (12, 10), "lines.markeredgewidth": 0.5 })

In [4]:
#--------------------------------------------------------
#--  Input File 1:  name.basics.tsv
#--------------------------------------------------------
print('Reading name.basics.tsv')
nameBasics = pd.read_csv("../Data/name.basics.tsv/data.tsv", sep='\t')
print('Complete - 1 of 3')
print(nameBasics.head(5))

#--------------------------------------------------------
#--  Input File 6:  title.principals.tsv
#--------------------------------------------------------
print('Reading title.principals.tsv')
titlePrincipals = pd.read_csv("../Data/title.principals.tsv/data.tsv", sep='\t')
print('Complete - 2 of 3')
print(titlePrincipals.head(5))

#--------------------------------------------------------
#--  Input File 7:  title.ratings.tsv
#--------------------------------------------------------
print('Reading title.ratings.tsv')
titleRatings = pd.read_csv("../Data/title.ratings.tsv/data.tsv", sep='\t',dtype={"tconst": object, "averageRating": float, "numVotes": int})
print('CompletitleRatingste - 3 of 3')
print(titleRatings.head(5))

print('\n-----all data loaded -----')

Reading name.basics.tsv
Complete - 1 of 3
      nconst      primaryName birthYear deathYear  \
0  nm0000001     Fred Astaire      1899      1987
1  nm0000002    Lauren Bacall      1924      2014
2  nm0000003  Brigitte Bardot      1934        \N
3  nm0000004     John Belushi      1949      1982
4  nm0000005   Ingmar Bergman      1918      2007

                primaryProfession                           knownForTitles
0  soundtrack,actor,miscellaneous  tt0043044,tt0072308,tt0050419,tt0045537
1              actress,soundtrack  tt0037382,tt0038355,tt0071877,tt0117057
2     actress,soundtrack,producer  tt0054452,tt0057345,tt0049189,tt0059956
3         actor,writer,soundtrack  tt0072562,tt0080455,tt0078723,tt0077975
4           writer,director,actor  tt0083922,tt0050986,tt0050976,tt0060827
Reading title.principals.tsv
Complete - 2 of 3
      tconst  ordering     nconst         category                      job  \
0  tt0000001         1  nm1588970             self                       \N
1  tt0000001         2  nm0005690         director                       \N
2  tt0000001         3  nm0374658  cinematographer  director of photography
3  tt0000002         1  nm0721526         director                       \N
4  tt0000002         2  nm1335271         composer                       \N

    characters
0  ["Herself"]
1           \N
2           \N
3           \N
4           \N
Reading title.ratings.tsv
CompletitleRatingste - 3 of 3
      tconst  averageRating  numVotes
0  tt0000001            5.8      1393
1  tt0000002            6.5       163
2  tt0000003            6.6       980
3  tt0000004            6.4        98
4  tt0000005            6.2      1674

-----all data loaded -----

### Dataset Descriptions

**name.basics.tsv.gz** - Contains the following information for names:

- nconst (string) – alphanumeric unique identifier of the name/person
- primaryName (string) – name by which the person is most often credited
- birthYear – in YYYY format
- deathYear – in YYYY format if applicable, else '\N'
- primaryProfession (array of strings) – the top-3 professions of the person
- knownForTitles (array of tconsts) – titles the person is known for


**title.principals.tsv** - Contains the principal cast/crew for titles:

- tconst (string) – alphanumeric unique identifier of the title
- ordering (integer) – a number to uniquely identify rows for a given titleId
- nconst (string) – alphanumeric unique identifier of the name/person
- category (string) – the category of job that person was in
- job (string) – the specific job title if applicable, else '\N'
- characters (string) – the name of the character played if applicable, else '\N'

### Merge Dataframes / Tables

In [5]:
print(len(titlePrincipals))
titlePrincipals.head(5)

29289842

,tconst,ordering,nconst,category,job,characters
0,tt0000001,1,nm1588970,self,\N,"[""Herself""]"
1,tt0000001,2,nm0005690,director,\N,\N
2,tt0000001,3,nm0374658,cinematographer,director of photography,\N
3,tt0000002,1,nm0721526,director,\N,\N
4,tt0000002,2,nm1335271,composer,\N,\N

In [ ]:
# drop unused columns
titlePrincipals = titlePrincipals.drop(['knownForTitles'], axis=1)

In [21]:
# replace values with '\N' with the pandas 'NaN'
# source: https://stackoverflow.com/a/49406417
titlePrincipals = titlePrincipals.replace({'\\N': np.nan})

In [6]:
print(len(nameBasics))
nameBasics.head()

8749442

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
0,nm0000001,Fred Astaire,1899,1987,"soundtrack,actor,miscellaneous","tt0043044,tt0072308,tt0050419,tt0045537"
1,nm0000002,Lauren Bacall,1924,2014,"actress,soundtrack","tt0037382,tt0038355,tt0071877,tt0117057"
2,nm0000003,Brigitte Bardot,1934,\N,"actress,soundtrack,producer","tt0054452,tt0057345,tt0049189,tt0059956"
3,nm0000004,John Belushi,1949,1982,"actor,writer,soundtrack","tt0072562,tt0080455,tt0078723,tt0077975"
4,nm0000005,Ingmar Bergman,1918,2007,"writer,director,actor","tt0083922,tt0050986,tt0050976,tt0060827"

In [33]:
# replace values with '\N' with the pandas 'NaN'
nameBasics_subset = nameBasics.replace({'\\N': np.nan})

In [7]:
# returns a left join of both dataframes
principal_data = pd.merge(titlePrincipals, nameBasics, how='left', on=['nconst'])

# Check the length of the resulting join
print(len(principal_data))

principal_data.head()

29289842

,tconst,ordering,nconst,category,job,characters,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
0,tt0000001,1,nm1588970,self,\N,"[""Herself""]",Carmencita,\N,\N,soundtrack,"tt0057728,tt0000001"
1,tt0000001,2,nm0005690,director,\N,\N,William K.L. Dickson,1860,1935,"cinematographer,director,producer","tt0219560,tt1428455,tt6687694,tt1496763"
2,tt0000001,3,nm0374658,cinematographer,director of photography,\N,William Heise,\N,1910,"cinematographer,director,producer","tt0241393,tt0285863,tt0241715,tt0229665"
3,tt0000002,1,nm0721526,director,\N,\N,Émile Reynaud,1844,1918,director,"tt2184231,tt0000003,tt2184201,tt0413219"
4,tt0000002,2,nm1335271,composer,\N,\N,Gaston Paulin,1839,1903,composer,"tt0000003,tt0000004,tt0000002"

<hr> 

## Explore the Data

**Decision Needed:** Do we limit the analysis of cast and crew to just movies? Or do we take into account their experience on other projects such as television?

**Decision Needed:** Do we remove cast/crew that are no longer living? The goal is to decide who to hire.

In [ ]:
# drop unused columns
principal_data = principal_data.drop(['knownForTitles', 'birthYear'], axis=1)

In [19]:
len(principal_data)

29289842

In [21]:
# replace values with '\N' with the pandas 'NaN'
# source: https://stackoverflow.com/a/49406417
principal_data = principal_data.replace({'\\N': np.nan})

In [22]:
principal_data.deathYear.unique()

array([nan, '1935', '1910', '1918', '1903', '1931', '1933', '1896',
       '1936', '1951', '1928', '1940', '1948', '1939', '1970', '1963',
       '1954', '1907', '1943', '1921', '1941', '1911', '1920', '1925',
       '1938', '1905', '1859', '1944', '1930', '1956', '1926', '1917',
       '1924', '1915', '1968', '1957', '1950', '1959', '1955', '1932',
       '1958', '1703', '1870', '1953', '1832', '1929', '1780', '1923',
       '1945', '1971', '1616', '1961', '1937', '1984', '1981', '1916',
       '1947', '1949', '1976', '1962', '1942', '1969', '1902', '1946',
       '1979', '1919', '1898', '1745', '1901', '1882', '1966', '1890',
       '1899', '1913', '1885', '1934', '1973', '1909', '1974', '1960',
       '1912', '1852', '1863', '1965', '1991', '1922', '1964', '1895',
       '1985', '1883', '1892', '1980', '1977', '1967', '1927', '1893',
       '1865', '1877', '1873', '1972', '1983', '1914', '1986', '1975',
       '1875', '1880', '1952', '1837', '1999', '1851', '1908', '1673',
       '1889', '1849', '1850', '1894', '1993', '1900', '1860', '1978',
       '1982', '1864', '1824', '1995', '1862', '1988', '1794', '1872',
       '1987', '1884', '1989', '1625', '1868', '1881', '1990', '2003',
       '0019', '1861', '1321', '1843', '1897', '1879', '1887', '2004',
       '1904', '2009', '1805', '2000', '1998', '1857', '1774', '1888',
       '1994', '1681', '1830', '2010', '1992', '2002', '1855', '1763',
       '1996', '1816', '1876', '1779', '1715', '1906', '1848', '2006',
       '1827', '1871', '1997', '1822', '1891', '2007', '1754', '1878',
       '2001', '1811', '1854', '2013', '2018', '2005', '1856', '1731',
       '2012', '1781', '1842', '1853', '2017', '1556', '1844', '1527',
       '1846', '2011', '1375', '1874', '1834', '2008', '2014', '2015',
       '1828', '1635', '1799', '1814', '2016', '1886', '1836', '1796',
       '1806', '1609', '1826', '1866', '1831', '1566', '1817', '1637',
       '1841', '1674', '1793', '1801', '1784', '1838', '1764', '1869',
       '1829', '1732', '1471', '1809', '1757', '1576', '1595', '1803',
       '1858', '1693', '1778', '0044', '1643', '1695', '1815', '1632',
       '1593', '1795', '1845', '1798', '1684', '1400', '1549', '1634',
       '1818', '1707', '1645', '1761', '1723', '1812', '1797', '1792',
       '1553', '1699', '1630', '1835', '1755', '1273', '1750', '1571',
       '1867', '1821', '1543', '1584', '1580', '1631', '1611', '1739',
       '1720', '1771', '1847', '1725', '1594', '1688', '1773', '1807',
       '1785', '1782', '1791', '1669', '1729', '1724', '1820', '1698',
       '1839', '1361', '1604', '1567', '1638', '1679', '1823', '1813',
       '1618', '1696', '1676', '1767', '1179', '1768', '1701', '1613',
       '1819', '1787', '1804', '1623', '1585', '1800', '1592', '0840',
       '1728', '1540', '1713', '1733', '1788', '1744', '1610', '1521',
       '1786', '1722', '1668', '1664', '1741', '1706', '1519', '1641',
       '1640', '1840'], dtype=object)

In [25]:
# check what rows are missing data
principal_data.isnull().sum()

tconst                      0
ordering                    0
nconst                      0
category                    0
job                  24437520
characters           14176704
primaryName              7753
deathYear            25671366
primaryProfession     1495813
dtype: int64

In [ ]:
principal_data = principal_data.drop([principal_data.deathYear.isnull() == False])

In [23]:
principal_data.head()

,tconst,ordering,nconst,category,job,characters,primaryName,deathYear,primaryProfession
0,tt0000001,1,nm1588970,self,NaN,"[""Herself""]",Carmencita,NaN,soundtrack
1,tt0000001,2,nm0005690,director,NaN,NaN,William K.L. Dickson,1935,"cinematographer,director,producer"
2,tt0000001,3,nm0374658,cinematographer,director of photography,NaN,William Heise,1910,"cinematographer,director,producer"
3,tt0000002,1,nm0721526,director,NaN,NaN,Émile Reynaud,1918,director
4,tt0000002,2,nm1335271,composer,NaN,NaN,Gaston Paulin,1903,composer

In [ ]:
# only keep the row if the person is still living
principal_data = principal_data.drop([principal_data.deathYear != '\\N'])

In [ ]:
principal_data.to_csv("../Data/principals_data.csv", sep='\t', index=False)

In [7]:
# returns a left join of both dataframes
#principal_data = pd.merge(principal_data, titleRatings, how='left', on=['tconst'])

# Check the length of the resulting join
print(len(principal_data))

principal_data.head()

29289842

,tconst,ordering,nconst,category,job,characters,averageRating,numVotes
0,tt0000001,1,nm1588970,self,\N,"[""Herself""]",5.8,1393.0
1,tt0000001,2,nm0005690,director,\N,\N,5.8,1393.0
2,tt0000001,3,nm0374658,cinematographer,director of photography,\N,5.8,1393.0
3,tt0000002,1,nm0721526,director,\N,\N,6.5,163.0
4,tt0000002,2,nm1335271,composer,\N,\N,6.5,163.0

In [10]:
principals = principal_data.copy()

<hr> 

## Model the Data

<hr> 

## Visualize the Results